package com.example.heifandroid

class GenerateRussianName {

    companion object{

        private val names: Array<String> = arrayOf(
            "Александр","Алексей","Альберт","Анатолий","Андрей","Антон","Аркадий","Арсений","Артём",
            "Борис","Вадим","Валентин","Валерий","Василий","Виктор","Виталий","Владимир","Владислав",
            "Вячеслав","Геннадий","Георгий","Герман","Григорий","Даниил","Денис","Дмитрий","Евгений",
            "Егор","Иван","Игнатий","Игорь","Илья","Константин","Лаврентий","Леонид","Лука","Макар",
            "Максим","Матвей","Михаил","Никита","Николай","Олег","Роман","Семён","Сергей","Станислав",
            "Степан","Фёдор","Эдуард","Юрий","Ярослав","Анна","Алёна","Алевтина","Александра","Алина",
            "Алла","Анастасия","Ангелина","Анжела","Анжелика","Антонида","Антонина","Анфиса","Арина",
            "Валентина","Валерия","Варвара","Василиса","Вера","Вероника","Виктория","Галина","Дарья",
            "Евгения","Екатерина","Елена","Елизавета","Жанна","Зинаида","Зоя","Ирина","Кира","Клавдия",
            "Ксения","Лариса","Лидия","Любовь","Людмила","Маргарита","Марина","Мария","Надежда","Наталья",
            "Нина","Оксана","Ольга","Раиса","Регина","Римма","Светлана","София","Таисия","Тамара","Татьяна",
            "Ульяна","Юлия")

        fun chooseRandomName():String{
            names.shuffle()
            return names[0]
        }
    }
}